1s/ERP/Conf/InformationRegisters/Лико_ОшибкиПравилПеремещенияТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ОшибкиПравилПеремещенияТМЦ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ПравилаПеремещенияТМЦ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияПоПравилу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресХраненияНовый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользоватьПравило</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стратегия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтратегииПеремещенияТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправкаСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Лико_ДокументыПеремещения</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ВидыОпераций_ПередачаСоСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ВидыОпераций_ПередачаСоСклада</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СОтветственногоХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаПоРаспоряжению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаДругойСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаДавальцу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаОтветственноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаМОЛ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ПравилаПеремещенияТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ПравилаПеремещенияТМЦ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СложнаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПравил</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стратегия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтратегииПеремещенияТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ДействияПоПравилуПеремещенияТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ПараметрыВыдачиНоменклатурыВПроизводство</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ОшибкиПравилПеремещенияТМЦ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Процедура СформироватьЗаписи(Объект,Отказ) Экспорт 
	
УстановитьПривилегированныйРежим(Истина);	
	Результат = Неопределено;
	
	
	Если Справочники.Лико_ПравилаПеремещенияТМЦ.СтартСистемы(Объект.Дата) Тогда
		
		Справочники.Лико_ПравилаПеремещенияТМЦ.ВыполнитьПроверку(Объект,Отказ,Результат);  
		
		Если ТипЗнч(Результат)=Тип("Структура") И Результат.Свойство("ПроверкаПравил") Тогда
			
			Если ТипЗнч(Результат.ПроверкаПравил)=Тип("ТаблицаЗначений") Тогда
				
				Для каждого Товар Из Результат.ПроверкаПравил Цикл 
					
					НаборЗаписей = РегистрыСведений.Лико_ОшибкиПравилПеремещенияТМЦ.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(Объект.Ссылка);
					НаборЗаписей.Отбор.Серия.Установить(Товар.Серия); 
					
					НаборЗаписей.Прочитать();
					
					Если НаборЗаписей.Количество()>0 Тогда
						
						Для каждого Запись Из НаборЗаписей Цикл 
							
							
							ОтправкаСообщения = Запись.ОтправкаСообщения;						
							ЗаполнитьЗначенияСвойств(Запись, Товар);
							Запись.Документ = Объект.Ссылка;
							Запись.Серия = Товар.Серия; 

							
						КонецЦикла; 
					Иначе
						
						НоваяЗапись = НаборЗаписей.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяЗапись, Товар);
						НоваяЗапись.Документ = Объект.Ссылка;
						НоваяЗапись.Серия = Товар.Серия; 

												
					КонецЕсли;
					
					НаборЗаписей.Записать();	
					
					
					
				КонецЦикла;	
				
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли
	
КонецПроцедуры

Процедура СформироватьЗаписиЗаявкаНаСклад(Объект,Отказ) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);	
	
	Если ТипЗнч(Объект.Ссылка)<>Тип("ДокументСсылка.Лико_ЗаявкаНаСклад") Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не Справочники.Лико_ПравилаПеремещенияТМЦ.СтартСистемы(Объект.Дата) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Объект.НеИспользоватьПравило Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Неопределено;
	
	Справочники.Лико_ПравилаПеремещенияТМЦ.ВыполнитьПроверку(Объект,Отказ,Результат);  
	
	
	
	Если ТипЗнч(Результат)=Тип("Структура") И Результат.Свойство("ПроверкаПравил") Тогда
		
		Если ТипЗнч(Результат.ПроверкаПравил)=Тип("ТаблицаЗначений") Тогда
			
			Для каждого Товар Из Результат.ПроверкаПравил Цикл 
				
				Если Не ЗначениеЗаполнено(Товар.Правило) Тогда 
					Продолжить;
				КонецЕсли;
				
				
				НаборЗаписей = РегистрыСведений.Лико_ОшибкиПравилПеремещенияТМЦ.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Документ.Установить(Объект.Ссылка);
				НаборЗаписей.Отбор.Серия.Установить(Товар.Серия); 
				
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество()>0 Тогда
					Для каждого Запись Из НаборЗаписей Цикл
						
						ЗаполнитьЗначенияСвойств(Запись, Товар);
						Запись.НеИспользоватьПравило = Истина;
						
						Если Объект.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда
							
							Запись.АдресХраненияНовый =  Объект.РабочийЦентр.ЛикоЯчейка;
							
						Иначе
							Запись.АдресХраненияНовый = Объект.Адрес;  
						КонецЕсли;
						
						Запись.Стратегия = Запись.Правило.Стратегия; 
						
						Запись.Комментарий = Справочники.Лико_ПравилаПеремещенияТМЦ.ТекстОтменыПравила(Запись.Правило,Запись.Серия.ЯССМ_ОбъектНоменклатуры);	
						
						
					КонецЦикла;
				Иначе
					
					
					НоваяЗапись = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяЗапись, Товар);
					НоваяЗапись.НеИспользоватьПравило = Истина;
					
					Если Объект.ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда
						
						НоваяЗапись.АдресХраненияНовый =  Объект.РабочийЦентр.ЛикоЯчейка;
						
					Иначе
						НоваяЗапись.АдресХраненияНовый = Объект.Адрес;  
					КонецЕсли;
					
					
					
					НоваяЗапись.Документ = Объект.Ссылка;
					
					НоваяЗапись.Серия = Товар.Серия;
					
					НоваяЗапись.Стратегия = НоваяЗапись.Правило.Стратегия; 
					НоваяЗапись.Комментарий = Справочники.Лико_ПравилаПеремещенияТМЦ.ТекстОтменыПравила(НоваяЗапись.Правило,НоваяЗапись.Серия.ЯССМ_ОбъектНоменклатуры);	
				КонецЕсли;
				
				
				НаборЗаписей.Записать();
				
				
				
				
			КонецЦикла;	
			
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура УстановкаПризнакаОтправкиСообщения(ДокументСсылка,Серия)  Экспорт //+--->Лико m.shenderov 02.03.2026
	НаборЗаписей = РегистрыСведений.Лико_ОшибкиПравилПеремещенияТМЦ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(ДокументСсылка);
	НаборЗаписей.Отбор.Серия.Установить(Серия); 
	
	НаборЗаписей.Прочитать(); 
	
	Для каждого Запись Из НаборЗаписей Цикл
		Запись.ОтправкаСообщения=Истина;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры //-<---Лико m.shenderov 02.03.2026





#КонецОбласти

#КонецЕсли
